[
    {
        "title": "Dreaming of the farthest reaches on Earth",
        "content": "My biggest goal/passion in life is to be able to travel the world and explore what this beautiful rock has to offer. I would like to save money for the next year or so then, when I feel I have enough to get by for a while, I would set off on a month to a year long journey of traveling to all the places I’m able to roam to. My only problem with this is the fact that this experience would be one that I would have to take alone as for none of my friends would be down for that kind of adventure, and I don’t know how much traveling really costs. Is there anyone here who can maybe share some information about their travels if you’ve had a similar experience? Is traveling the world just a boys dream, or is there an actual possibility?",
        "img": "https://www.krainabarw.pl/pol_pl_Fototapeta-8-983-Seaside-59171_1.jpg",
        "date": "2018/03/07",
        "author": "SlickJoe",
        "comments":[
            {
                "author": "SlickJoe",
                "content": "hello",
                "id": 0
            },
            {
                "author": "SlickJoe",
                "content": "hi",
                "id": 1
            },
            {
                "author": "SlickJoe",
                "content": "good morning",
                "id": 2
            }
        ],
        "id": 0
    },
    {
        "title": "Ideas for travelling in an ecologically and socially sustainable way in Europe",
        "content": "I and some friends (4 people) participate in a competition by the german goethe institute. Our task is to (1) plan a journey through europe using only ecollogically and socially sustainable methods. On the way we have to come through Ljubljana, Lissabon and Berlin and have to start in our hometown Thessaloniki. We're free to use any ways of travelling we can come up with as long as they are sustainable. Our first idea is to take trains and/or buses for the long distances and do some shorter sections with beautiful landscape by bike, canoe or hiking. Some ideas were hiking through the Alps, bicycling in Spain and Portugal and canoeing on the Spree river near Berlin (but there are logistical problems like: How can we hike with everything we carry for the whole journey? What can we do with our bikes when we don't need them?) (2) Additionally we're supposed to create a concept how we could promote our way of travelling and show people that it is possible to travel without having a bad impact on our environment. Therefore we need a concept how we could reach as many people as possible for example via social media and on the journey. I thought this is the right place to look for some inspiration especially for the first part of our concept. Any ideas are appreciated. Things we came up with that are important: • how to get from one city to the next (I mentioned some ideas above. Another idea is to do some travelling by ship but it shouldn't be too expensive and again has to be as sustainable as possible) • where to sleep (we already considered couchsurfing, camping and wilderness camping and of course staying in hostels and hotels but as I said it has to be sustainable) • where to eat • In which order to link the cities (right now the idea is to go from Thessaloniki to Ljubljana, over the Alps through Germany to Berlin and then to Lissabon but we're open to new suggestions) • how to reach people via social media • how to convince people of sustainable travelling on our way (we thought about asking locals to join us for some hours/days but are not sure if that is realistic and what would be a good platform for doing so) • etc. The 10 teams with the best concepts will be allowed and helped to complete their journey.",
        "img": "https://www.kids-world-travel-guide.com/images/xwelcometoeurope_560.png.pagespeed.ic.Gk5hdb0PIH.jpg",
        "author": "SlickJoe",
        "date": "2020/05/07",
        "comments":[
            {
                "author": "SlickJoe",
                "content": "hello",
                "id": 0
            },
            {
                "author": "SlickJoe",
                "content": "hi",
                "id": 1
            },
            {
                "author": "SlickJoe",
                "content": "good morning",
                "id": 2
            }
        ],
        "id": 1
    },
    {
        "title": "Missing a connection and renting a car one-way",
        "content": "This hasn’t happened but asking just in case it does. Booked a trip to Jackson from DFW with a layover in Denver, on United. I’ve flown into DEN a few times and know the airport well. We have a 53 minute connection. In the event that we miss it, would a rental car company be able to access our reservation from JAC? And assuming the one-way fee will be ridiculous, would United potentially reimburse us?",
        "img": "https://www.saga.co.uk/contentlibrary/saga/publishing/verticals/motoring/cars/enjoying/things-car-hire-companies-dont-want-you-to-know-shutterstock-214359349.jpg",
        "author": "SlickJoe",
        "date": "2020/05/27",
        "comments":[
            {
                "author": "SlickJoe",
                "content": "hello",
                "id": 0
            },
            {
                "author": "SlickJoe",
                "content": "hi",
                "id": 1
            },
            {
                "author": "SlickJoe",
                "content": "good morning",
                "id": 2
            }
        ],
        "id": 2
    },
    {
        "title": "Is it safe to buy connecting flights separately?",
        "content": "I need to move out of my country (Paraguay) to the Netherlands and it seems that most routes are not open due to obvious reasons. My plan is to go to Madrid from Asuncion and from Madrid to Amsterdam and I am able to find flights with this route separately but not together. What do you advice me to do? I think the only issue would be the baggage drop off in Madrid that I would have to check in again for the flight to Amsterdam. help",
        "img": "https://media.cntraveler.com/photos/5b47bf2c4b1b564ac0e61d76/master/w_1024,c_limit/CNT_Intel_Plane%2520Tickets_072018_TM%2520Detwiler.jpg",
        "author": "SlickJoe",
        "date": "2019/06/14",
        "comments":[
            {
                "author": "SlickJoe",
                "content": "hello",
                "id": 0
            },
            {
                "author": "SlickJoe",
                "content": "hi",
                "id": 1
            },
            {
                "author": "SlickJoe",
                "content": "good morning",
                "id": 2
            }
        ],
        "id": 3
    },
    {
        "title": "Anyone thinking of relocating while doing online school?",
        "content": "My friend brought up an interesting idea, since our first semester and possible second semester of uni will be online. He thought he might go abroad and do school remotely somewhere with a low COL. I was wondering if anyone else on this sub was considering the same? Would travel restrictions seriously impede you, and would you have any destinations in mind? Maybe a working holiday visa might be appropriate for this kind of thing. Mostly just wanted to hear everyone’s thoughts!",
        "img": "https://s3.eu-central-1.amazonaws.com/pressland-cms/cache/article_show_cover/je/22507940-akademeia-high-school-przy-ulicy-ledochowskiej-w-miasteczku.jpeg",
        "author": "SlickJoe",
        "date": "2016/06/07",
        "comments":[
            {
                "author": "SlickJoe",
                "content": "hello",
                "id": 0
            },
            {
                "author": "SlickJoe",
                "content": "hi",
                "id": 1
            },
            {
                "author": "SlickJoe",
                "content": "good morning",
                "id": 2
            }
        ],
        "id": 4
    },
    {
        "title": "Solo trip to Zion from Vegas",
        "content": "Hello, all. Once things settles down a bit more I am planning a quick 3 day trip to Zion, maybe a Sunday - Wednesday including flight. I would be landing in Vegas and driving to Zion to spend probably 2 in a half days. I am a 26F in good shape, but not used to vigorous hiking due to flat trails in the Midwest, although I try to hike long distances every couple of weeks. I’m looking for any and all advice. As much as I would love to backpack overnight I was thinking of staying in the nearby town and just full on hiking the two full days before dark. Had trouble looking this up in the search bar as well lol.",
        "img": "https://www.telegraph.co.uk/content/dam/Travel/Destinations/North%20America/USA/Las%20Vegas/las-vegas-lead-image.jpg",
        "author": "SlickJoe",
        "date": "2017/06/07",
        "comments":[
            {
                "author": "SlickJoe",
                "content": "hello",
                "id": 0
            },
            {
                "author": "SlickJoe",
                "content": "hi",
                "id": 1
            },
            {
                "author": "SlickJoe",
                "content": "good morning",
                "id": 2
            }
        ],
        "id": 5
    },
    {
        "title": "Road Trip",
        "content": "Hi guys. The wife and I are planning a road trip to pick up a puppy I got for her. Leaving from Richmond, Virginia & we’re picking him up in Livingston, Alabama. We want to make it a fun road trip and want to stop by the major cities we cross. The cities are: Charlotte, North Carolina Atlanta, Georgia Birmingham, Alabama Knoxville, Tennessee. Do you guys have any places you recommend to stop in each city for sightseeing near the highways? Any input is appreciated!",
        "img": "https://cdn.pixabay.com/photo/2019/07/30/05/53/dog-4372036__340.jpg",
        "author": "SlickJoe",
        "date": "2020/04/20",
        "comments":[
            {
                "author": "SlickJoe",
                "content": "hello",
                "id": 0
            },
            {
                "author": "SlickJoe",
                "content": "hi",
                "id": 1
            },
            {
                "author": "SlickJoe",
                "content": "good morning",
                "id": 2
            }
        ],
        "id": 6
    },
    {
        "title": "Travelling cheap in the UK?",
        "content": "I'm from wales and I'm going to university in September, but as soon as it is **100% SAFE** I really need to get out of my house for personal/family related reasons. I can't afford to stay in hotels for over a month, is there any other way I can live on my own affordably?",
        "img": "https://resize.hswstatic.com/w_907/gif/UK-Britain-1.jpg",
        "author": "SlickJoe",
        "date": "2020/05/07",
        "comments":[
            {
                "author": "SlickJoe",
                "content": "hello",
                "id": 0
            },
            {
                "author": "SlickJoe",
                "content": "hi",
                "id": 1
            },
            {
                "author": "SlickJoe",
                "content": "good morning",
                "id": 2
            }
        ],
        "id": 7
    },
    {
        "title": "Central America - Contiki vs. G Adventures",
        "content": "I'm looking to travel Central America in a group tour but can't decide between Contiki and G Adventures. G Adventures have a longer and cheaper tour (Central American Journey: Rainforests & Ruins) but the accommodation is way nicer for Contiki (no homestays, just hotels or hostels). I've also heard Contiki tours (Tropical Trails) are more 'fun'. Does anyone have any experience with these that they could share? Thanks!",
        "img": "https://www.azamara.com/sites/default/files/heros/hero-centralamerica.jpg",
        "author": "SlickJoe",
        "date": "2020/06/02",
        "comments":[
            {
                "author": "SlickJoe",
                "content": "hello",
                "id": 0
            },
            {
                "author": "SlickJoe",
                "content": "hi",
                "id": 1
            },
            {
                "author": "SlickJoe",
                "content": "good morning",
                "id": 2
            }
        ],
        "id": 8
    },
    {
        "title": "Need recommendations for a family vacation on the East",
        "content": "Everyone in my family is over the age of 21 but our parents just retired and we're trying to do something special for them since they just retired this year. We plan to have the trip be close to New Years and one of my brothers recommended a trip in Bald Head, NC and getting a house there. I just want to see if there's any options we might not be thinking of that could be better.",
        "img": "https://www.familyvacationcritic.com/wp-content/uploads/sites/19/2017/12/jerseyshorebesteast.jpg",
        "author": "SlickJoe",
        "date": "2020/05/07",
        "comments":[
            {
                "author": "SlickJoe",
                "content": "hello",
                "id": 0
            },
            {
                "author": "SlickJoe",
                "content": "hi",
                "id": 1
            },
            {
                "author": "SlickJoe",
                "content": "good morning",
                "id": 2
            }
        ],
        "id": 9
    },
    {
        "title": "Looking to visit Vietnam - how much time should I give myself",
        "content": "For some time now, I've wanted to go to Vietnam. Everyone I've spoken to who's gone, loves it. Great food, beautiful views, and just overall a nice place to visit. My job requires me to take a mandatory 2-weeks off from work every year (this can be extended, but dips into more PTO obviously). Hanoi (& Ha Long Bay in particular), Hue, Hoi An, and Ho Chi Minh are among the top places in Vietnam I would like to visit. My question is this. Is 2-weeks enough time to properly see all of those places listed above? (I can also live with only seeing 2 or 3 of the cities I've listed - always need to leave a reason to come back). Since I'm coming from East Coast US, a 1 or 2 day layover in Seoul/Taipei/other major Asian gateway city I have not been to yet would be factored into this trip as well.",
        "img": "https://d16yj43vx3i1f6.cloudfront.net/uploads/2019/12/main_0000_Vietnam_1200-1088x529.jpg",
        "author": "SlickJoe",
        "date": "2019/06/07",
        "comments":[
            {
                "author": "SlickJoe",
                "content": "hello",
                "id": 0
            },
            {
                "author": "SlickJoe",
                "content": "hi",
                "id": 1
            },
            {
                "author": "SlickJoe",
                "content": "good morning",
                "id": 2
            }
        ],
        "id": 10
    },
    {
        "title": "US Road Trip",
        "content": "I'll be taking online classes for the next year or so and thought it would be a perfect opportunity to travel the US at the same time. Here are some trip details - I plan to purchase a converted sprinter van to live in for about $20,000 - this will cut the cost of hotels and I plan to sell it after my trip is over. I'll have about 6 months to do this trip, starting in January 2021 and ending in June/July 2021. My starting point will be Salt Lake City, Utah. I want to visit national parks, important historical sites, and cultural hotspots.",
        "img": "https://cdn.britannica.com/s:700x500/82/183382-050-D832EC3A/Detail-head-crown-Statue-of-Liberty-New.jpg",
        "author": "SlickJoe",
        "date": "2020/06/03",
        "comments":[
            {
                "author": "SlickJoe",
                "content": "hello",
                "id": 0
            },
            {
                "author": "SlickJoe",
                "content": "hi",
                "id": 1
            },
            {
                "author": "SlickJoe",
                "content": "good morning",
                "id": 2
            }
        ],
        "id": 11
    },
    {
        "title": "Remote work - time to travel!",
        "content": "My gf and I are finally getting out of our leases in August and are planning to drive around the US, staying in Airbnb’s and with friends/family, for the remainder of the year. We want to ski, hike, eat good food, all while remotely working during the week. Since we will have the freedom, we can stay in one place a month, or just a couple days, and everything in between, we just need internet/WiFi during the week.",
        "img": "https://elanskis.com/media/catalog/category/womens_skis_7.jpg",
        "author": "SlickJoe",
        "date": "2020/06/04",
        "comments":[
            {
                "author": "SlickJoe",
                "content": "hello",
                "id": 0
            },
            {
                "author": "SlickJoe",
                "content": "hi",
                "id": 1
            },
            {
                "author": "SlickJoe",
                "content": "good morning",
                "id": 2
            }
        ],
        "id": 12
    },
    {
        "title": "Looking for sightseeing suggestions for a cross-country (USA) road trip this summer",
        "content": "My boyfriend (20M) and I (20F) are planning a trip from Duluth, MN out to the coast of California this summer. This will be basically his first time traveling outside the the state, so I want to hit some basics: Mount Rushmore, Wall Drugstore, Badlands, maybe the Four Corners. I have seen all these places, and would also like to experience somthing new, while showing him the places I've been. Any suggestions for must-stop attractions between MN and CA? We plan to spend 4 days drving.",
        "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7e/Hopkinson_Flag_for_the_United_States.pdf/page1-350px-Hopkinson_Flag_for_the_United_States.pdf.jpg",
        "author": "SlickJoe",
        "date": "2020/06/05",
        "comments":[
            {
                "author": "SlickJoe",
                "content": "hello",
                "id": 0
            },
            {
                "author": "SlickJoe",
                "content": "hi",
                "id": 1
            },
            {
                "author": "SlickJoe",
                "content": "good morning",
                "id": 2
            }
        ],
        "id": 13
    },
    {
        "title": "Where is the best/most reasonable place to purchase medical travel insurance?",
        "content": "I’m going to Tahiti with my gf next month (from America) but they require medical travel insurance for the trip. I am just looking for some advice as to what the best options are and if you guys have any personal preferences. I’d appreciate any help and advice",
        "img": "https://i2.wp.com/whereisjuli.com/wp-content/uploads/2015/02/tahiti-tourism.jpg?resize=600%2C400&ssl=1",
        "author": "SlickJoe",
        "date": "2020/06/06",
        "comments":[
            {
                "author": "SlickJoe",
                "content": "hello",
                "id": 0
            },
            {
                "author": "SlickJoe",
                "content": "hi",
                "id": 1
            },
            {
                "author": "SlickJoe",
                "content": "good morning",
                "id": 2
            }
        ],
        "id": 14
    },
    {
        "title": "Travel on Boat/ship for minimum",
        "content": "Hi guys , me and my 2 friends are going to crete and back to Slovakia (2000km) by hitchhiking we wanna spend max 10 euro per day but ferry costs like 50 or 60 euros , but i heard something about finding a sailboat Ride which could cost lower or does anyone know about something like we would be working/helping with something on Boat and we would get from crete for free , so my questin is if you have some information or experiences with travelling on boat for minimum/free ?",
        "img": "https://r-cf.bstatic.com/images/hotel/max1024x768/171/171431216.jpg",
        "author": "SlickJoe",
        "date": "2020/06/07",
        "comments":[
            {
                "author": "SlickJoe",
                "content": "hello",
                "id": 0
            },
            {
                "author": "SlickJoe",
                "content": "hi",
                "id": 1
            },
            {
                "author": "SlickJoe",
                "content": "good morning",
                "id": 2
            }
        ],
        "id": 15
    }
    
]